wrk2/dome-no-cache/1024KB/wrk-eth3-rep01.log
Running 30s test @ https://bench-eth2.netdev-lab.org/1024k.bin
  4 threads and 100 connections
  Thread calibration: mean lat.: 942.618ms, rate sampling interval: 2254ms
  Thread calibration: mean lat.: 889.319ms, rate sampling interval: 2222ms
  Thread calibration: mean lat.: 909.427ms, rate sampling interval: 2310ms
  Thread calibration: mean lat.: 920.810ms, rate sampling interval: 2183ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   901.66ms  188.42ms   2.50s    83.77%
    Req/Sec    15.88      4.32    22.00     91.18%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%  927.74ms
 75.000%    1.00s 
 90.000%    1.05s 
 99.000%    1.18s 
 99.900%    2.45s 
 99.990%    2.50s 
 99.999%    2.50s 
100.000%    2.50s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

      42.559     0.000000            1         1.00
     683.519     0.100000          130         1.11
     783.871     0.200000          261         1.25
     844.287     0.300000          390         1.43
     891.391     0.400000          521         1.67
     927.743     0.500000          650         2.00
     944.639     0.550000          718         2.22
     958.463     0.600000          781         2.50
     973.311     0.650000          847         2.86
     988.159     0.700000          910         3.33
    1001.471     0.750000          976         4.00
    1009.663     0.775000         1010         4.44
    1016.831     0.800000         1040         5.00
    1026.559     0.825000         1075         5.71
    1036.799     0.850000         1107         6.67
    1045.503     0.875000         1140         8.00
    1049.599     0.887500         1156         8.89
    1054.719     0.900000         1173        10.00
    1060.863     0.912500         1187        11.43
    1065.983     0.925000         1204        13.33
    1071.103     0.937500         1220        16.00
    1075.199     0.943750         1227        17.78
    1079.295     0.950000         1235        20.00
    1084.415     0.956250         1244        22.86
    1092.607     0.962500         1252        26.67
    1099.775     0.968750         1261        32.00
    1101.823     0.971875         1264        35.56
    1104.895     0.975000         1268        40.00
    1113.087     0.978125         1272        45.71
    1132.543     0.981250         1276        53.33
    1147.903     0.984375         1281        64.00
    1148.927     0.985938         1282        71.11
    1154.047     0.987500         1284        80.00
    1179.647     0.989062         1286        91.43
    1191.935     0.990625         1288       106.67
    1221.631     0.992188         1290       128.00
    1236.991     0.992969         1291       142.22
    1316.863     0.993750         1292       160.00
    1950.719     0.994531         1293       182.86
    2103.295     0.995313         1294       213.33
    2211.839     0.996094         1295       256.00
    2269.183     0.996484         1296       284.44
    2269.183     0.996875         1296       320.00
    2408.447     0.997266         1297       365.71
    2408.447     0.997656         1297       426.67
    2435.071     0.998047         1298       512.00
    2435.071     0.998242         1298       568.89
    2435.071     0.998437         1298       640.00
    2449.407     0.998633         1299       731.43
    2449.407     0.998828         1299       853.33
    2449.407     0.999023         1299      1024.00
    2449.407     0.999121         1299      1137.78
    2449.407     0.999219         1299      1280.00
    2500.607     0.999316         1300      1462.86
    2500.607     1.000000         1300          inf
#[Mean    =      901.657, StdDeviation   =      188.417]
#[Max     =     2498.560, Total count    =         1300]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  2000 requests in 30.13s, 1.97GB read
Requests/sec:     66.39
Transfer/sec:     67.08MB