wrk2/dome-no-cache/1024KB/wrk-eth3-rep03.log
Running 30s test @ https://bench-eth2.netdev-lab.org/1024k.bin
  4 threads and 100 connections
  Thread calibration: mean lat.: 855.315ms, rate sampling interval: 2078ms
  Thread calibration: mean lat.: 859.260ms, rate sampling interval: 2086ms
  Thread calibration: mean lat.: 840.107ms, rate sampling interval: 2113ms
  Thread calibration: mean lat.: 840.934ms, rate sampling interval: 2113ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   837.45ms  172.80ms   2.45s    80.46%
    Req/Sec    14.69      4.23    23.00     83.33%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%  862.21ms
 75.000%  937.47ms
 90.000%  990.72ms
 99.000%    1.06s 
 99.900%    2.42s 
 99.990%    2.46s 
 99.999%    2.46s 
100.000%    2.46s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

     228.863     0.000000            1         1.00
     628.735     0.100000          124         1.11
     721.919     0.200000          245         1.25
     784.895     0.300000          368         1.43
     827.391     0.400000          490         1.67
     862.207     0.500000          614         2.00
     877.567     0.550000          674         2.22
     892.415     0.600000          737         2.50
     905.727     0.650000          795         2.86
     923.647     0.700000          857         3.33
     937.471     0.750000          920         4.00
     943.615     0.775000          949         4.44
     951.807     0.800000          981         5.00
     958.463     0.825000         1010         5.71
     967.167     0.850000         1041         6.67
     976.895     0.875000         1071         8.00
     984.575     0.887500         1086         8.89
     990.719     0.900000         1102        10.00
     994.303     0.912500         1116        11.43
    1003.007     0.925000         1132        13.33
    1008.127     0.937500         1148        16.00
    1012.223     0.943750         1156        17.78
    1014.271     0.950000         1162        20.00
    1017.855     0.956250         1171        22.86
    1026.047     0.962500         1178        26.67
    1028.607     0.968750         1186        32.00
    1031.679     0.971875         1189        35.56
    1039.871     0.975000         1193        40.00
    1043.967     0.978125         1197        45.71
    1051.647     0.981250         1201        53.33
    1054.719     0.984375         1204        64.00
    1058.815     0.985938         1206        71.11
    1062.911     0.987500         1208        80.00
    1064.959     0.989062         1211        91.43
    1068.031     0.990625         1212       106.67
    1087.487     0.992188         1214       128.00
    1095.679     0.992969         1215       142.22
    1097.727     0.993750         1216       160.00
    1098.751     0.994531         1217       182.86
    1141.759     0.995313         1218       213.33
    2234.367     0.996094         1219       256.00
    2234.367     0.996484         1219       284.44
    2246.655     0.996875         1220       320.00
    2246.655     0.997266         1220       365.71
    2381.823     0.997656         1221       426.67
    2381.823     0.998047         1221       512.00
    2381.823     0.998242         1221       568.89
    2416.639     0.998437         1222       640.00
    2416.639     0.998633         1222       731.43
    2416.639     0.998828         1222       853.33
    2416.639     0.999023         1222      1024.00
    2416.639     0.999121         1222      1137.78
    2455.551     0.999219         1223      1280.00
    2455.551     1.000000         1223          inf
#[Mean    =      837.448, StdDeviation   =      172.800]
#[Max     =     2453.504, Total count    =         1223]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  1880 requests in 30.13s, 1.86GB read
  Socket errors: connect 0, read 0, write 0, timeout 90
Requests/sec:     62.40
Transfer/sec:     63.09MB