wrk2/dome-no-cache/1024KB/wrk-eth3-rep04.log
Running 30s test @ https://bench-eth2.netdev-lab.org/1024k.bin
  4 threads and 100 connections
  Thread calibration: mean lat.: 877.942ms, rate sampling interval: 2187ms
  Thread calibration: mean lat.: 892.716ms, rate sampling interval: 2189ms
  Thread calibration: mean lat.: 886.002ms, rate sampling interval: 2215ms
  Thread calibration: mean lat.: 843.150ms, rate sampling interval: 2279ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   897.68ms  230.00ms   4.03s    87.44%
    Req/Sec    15.94      4.05    22.00     80.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%  919.55ms
 75.000%  996.86ms
 90.000%    1.05s 
 99.000%    1.18s 
 99.900%    3.80s 
 99.990%    4.03s 
 99.999%    4.03s 
100.000%    4.03s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

      90.047     0.000000            1         1.00
     660.991     0.100000          130         1.11
     765.951     0.200000          260         1.25
     831.487     0.300000          390         1.43
     881.151     0.400000          523         1.67
     919.551     0.500000          649         2.00
     935.935     0.550000          714         2.22
     951.295     0.600000          780         2.50
     970.239     0.650000          847         2.86
     985.087     0.700000          910         3.33
     996.863     0.750000          976         4.00
    1007.615     0.775000         1006         4.44
    1015.295     0.800000         1039         5.00
    1024.511     0.825000         1072         5.71
    1033.215     0.850000         1107         6.67
    1045.503     0.875000         1138         8.00
    1049.599     0.887500         1153         8.89
    1053.695     0.900000         1169        10.00
    1060.863     0.912500         1185        11.43
    1070.079     0.925000         1204        13.33
    1081.343     0.937500         1217        16.00
    1088.511     0.943750         1227        17.78
    1092.607     0.950000         1234        20.00
    1097.727     0.956250         1242        22.86
    1104.895     0.962500         1250        26.67
    1111.039     0.968750         1258        32.00
    1118.207     0.971875         1262        35.56
    1121.279     0.975000         1266        40.00
    1128.447     0.978125         1270        45.71
    1141.759     0.981250         1274        53.33
    1156.095     0.984375         1278        64.00
    1164.287     0.985938         1280        71.11
    1177.599     0.987500         1282        80.00
    1180.671     0.989062         1284        91.43
    1184.767     0.990625         1286       106.67
    1348.607     0.992188         1288       128.00
    1981.439     0.992969         1289       142.22
    2232.319     0.993750         1290       160.00
    2371.583     0.994531         1291       182.86
    2379.775     0.995313         1292       213.33
    2439.167     0.996094         1293       256.00
    2471.935     0.996484         1294       284.44
    2471.935     0.996875         1294       320.00
    2492.415     0.997266         1295       365.71
    2492.415     0.997656         1295       426.67
    2596.863     0.998047         1296       512.00
    2596.863     0.998242         1296       568.89
    2596.863     0.998437         1296       640.00
    3803.135     0.998633         1297       731.43
    3803.135     0.998828         1297       853.33
    3803.135     0.999023         1297      1024.00
    3803.135     0.999121         1297      1137.78
    3803.135     0.999219         1297      1280.00
    4028.415     0.999316         1298      1462.86
    4028.415     1.000000         1298          inf
#[Mean    =      897.679, StdDeviation   =      229.997]
#[Max     =     4026.368, Total count    =         1298]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  1997 requests in 30.13s, 1.97GB read
  Socket errors: connect 0, read 0, write 0, timeout 1
Requests/sec:     66.29
Transfer/sec:     66.94MB